[
  {
    "boothId": "TD01",
    "name": "Building for the Future with AI",
    "subtitle": "Agents? DeepSeek? What it really takes to create value at scale with AI",
    "description": "AI is every CEO’s top priority in 2025, yet only one in four companies scale AI successfully, and just 4% are creating substantial value. The key? Focus on fewer, high-impact opportunities within core functions. Industry leaders are moving beyond pilots to real E2E transformation and reshaping end-to-end workflows. Join us to discover how—with insights from 100+ AI transformation programs and 1,000+ companies worldwide, we have the answers!",
    "sectorjourneys": "CIDRET, CP, EEW, HCS, LHI, PCCI",
    "topicjourneys": "AI",
    "x": 1823,
    "y": 4726,
    "partner": "",
    "contacts": "Michael Grebe, grebe.michael@bcg.com, Vinciane Beauchene, beauchene.vinciane@bcg.com, Nicolas de Bellefonds, debellefonds.nicolas@bcg.com, Julie Bedard, bedard.julie@bcg.com",
    "highlightUrl": "/highlights/td01.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; Cost; POP; People and Organization; FI; HC; IG; Insurance; PIPE; Public Sector; TMT; TCI; robot; AI transformation; cafe"
  },
  {
    "boothId": "TD02",
    "name": "Frontier Express: Driving the Future of Tech",
    "subtitle": "Frontier Tech creates 10x value—how much has your client captured",
    "description": "Hop aboard the Frontier Express and experience the convergence of Web3, XR, IoT, and Quantum. Use your digital wallet to board, explore interactive demos, and earn tokens to redeem at our bar. Discover how smart glasses boost worker efficiency by 29% and cut costs by $50M per year. Dive into track-and-trace solutions for goods and learn how optimized supply chains transform logistics. Finally, look into the future as quantum tech enhances security and powers the next generation of trains.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1916,
    "y": 4584,
    "partner": "",
    "contacts": "Tibor Merey, Merey.Tibor@bcg.com, Matt Langione, langione.matt@bcg.com, Urs Rahne, rahne.urs@bcg.com, Awais Ali, ali.awais@bcg.com",
    "highlightUrl": "/highlights/td02.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; Cost; web3; XR; IoT; Quantum; digital wallet; smart glasses; supply chain; Walt.ID; IG; TMT; TCI; Operations; FI; Financial Institutions; Industrial Goods"
  },
  {
    "boothId": "TD03",
    "name": "AI-First Companies",
    "subtitle": "How to rewire your company for an AI-first future",
    "description": "What does the AI-first company look like? It’s not just about adopting AI – AI- first companies fundamentally rethink how their business operates, and end up unlocking new value pools, shifting competitive advantages, and redefining industries. Discover the roadmap to making AI-first a reality by learning from examples of existing AI-first companies. Experience the future through curated demos, from GenAI-driven sales to AI-powered drug discovery.",
    "sectorjourneys": "CPBB, PF, RT, TECH",
    "topicjourneys": "AI",
    "x": 1980,
    "y": 4291,
    "partner": "",
    "contacts": "Amanda Luther, luther.amanda@bcg.com, Chris Meier, meier.chris@bcg.com, Chris Freese, Freese.Christopher@bcg.com, Arnaud Bassoulet, Bassoulet.Arnaud@bcg.com",
    "highlightUrl": "/highlights/td03.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; Agents; AI Transformation; sales; POP; CP; FI; IG; INS; HC; Consumer Products; Financial Institutions; Healthcare; Industrial Goods; Insurance"
  },
  {
    "boothId": "TD04",
    "name": "OpenAI",
    "subtitle": "The leading AI models and products that power businesses worldwide",
    "description": "We build and deploy AI for businesses - enabling employees, automating operations, and enhancing products. ChatGPT Enterprise helps businesses deploy AI strategically, responsibly, and at scale, and our best-in-class API platform empowers enterprises to build industry-leading AI products and experiences. Our booth features live demos of our latest models and products as well as some of our solutions jointly built with BCG.",
    "sectorjourneys": "PPSS",
    "topicjourneys": "AI",
    "x": 2346,
    "y": 5216,
    "partner": "Y",
    "contacts": "Dan Sack, Sack.Dan@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/td04.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD05",
    "name": "NextGen ERP",
    "subtitle": "Unlock Business Growth – AI-Driven ERP for smarter, faster transformation",
    "description": "Step into the future of business transformation with BCG’s NextGen ERP! Explore our interactive digital game, engage with industry experts, and discover our unique value proposition. See how organizations are leveraging AI-powered ERP transformations to drive business value. Don’t miss this opportunity to learn, connect, and win exciting prizes!",
    "sectorjourneys": "BPH, MPI, MT",
    "topicjourneys": "TP",
    "x": 2346,
    "y": 4528,
    "partner": "",
    "contacts": "Ted Kubit, kubit.ted@bcg.com, Loïc Mesnage, mesnage.loic@bcg.com, Daniel Schlecht, schlecht.daniel@bcg.com, Andrew Arcuri, arcuri.andrew@bcg.com",
    "highlightUrl": "/highlights/td05.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; SAP; Anaplan; Workday; ServiceNow; digital transformation; cost;"
  },
  {
    "boothId": "TD06",
    "name": "SAP",
    "subtitle": "BCG & SAP powering opportunities with data-driven innovation and AI",
    "description": "Transform your future with us  Experience the future of business transformation at the SAP booth. Discover the power of Business Data Cloud, Agentic AI, and Business Suite through interactive demos. Learn from real-world success stories showcasing the BCG x SAP partnership. Witness how strategic consulting and data-driven innovation can drive exponential success for your organization. Together, we’re more than the sum of our parts. We’re the future of business transformation.",
    "sectorjourneys": "",
    "topicjourneys": "TP",
    "x": 2346,
    "y": 4757,
    "partner": "Y",
    "contacts": "Ted Kubit, kubit.ted@bcg.com",
    "highlightUrl": "/highlights/td06.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD07",
    "name": "Cyber Risk: Keep Your Business Prepared",
    "subtitle": "Crisis-proof your business: be ready, be resilient",
    "description": "Cyber crises aren’t a question of if, but when. At BCG’s Cyber & Digital Risk division, we help businesses prepare, respond & recover from threats with precision and speed. Explore how leading organizations:  •  Strengthen crisis preparedness through real-world simulations  •  Deploy recovery strategies to minimize disruption  •  Leverage AI-driven insights to stay ahead  Join us for interactive demos and discussions as preparation is the ultimate defense.",
    "sectorjourneys": "DS, PF",
    "topicjourneys": "GP",
    "x": 2346,
    "y": 4972,
    "partner": "",
    "contacts": "Vanessa Lyon, lyon.vanessa@bcg.com, Gildas Bouteiller, bouteiller.gildas@bcg.com, Pierre Rouseel, roussel.pierre@bcg.com, Shoaib Yousuf, yousuf.shoaib@bcg.com",
    "highlightUrl": "/highlights/td07.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; Cost; hack; threat; cyber protection; R&C; FI; CP; HC; IG; PS; EN; TMT; Risk & Compliance; Financial Institutions; Consumer Products; Healthcare; Industrial Goods; Public Sector; Industrial Goods; Energy; Technology, Media & telcomm"
  },
  {
    "boothId": "TD08",
    "name": "Anthropic",
    "subtitle": "Anthropic, AI research and products that put safety at the frontier",
    "description": "Anthropic is an AI safety and research company that is working to build reliable, interpretable, and steerable AI systems. Our flagship product is Claude, a family of foundational AI models designed for enterprise applications.",
    "sectorjourneys": "PPSS",
    "topicjourneys": "",
    "x": 2305,
    "y": 5527,
    "partner": "Y",
    "contacts": "Tom Martin, Martin.Tom@bcgplatinion.com, Hillary Fernandez, Fernandez.Hillary@bcg.com",
    "highlightUrl": "/highlights/td08.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD09",
    "name": "IBM",
    "subtitle": "Pioneering AI-driven productivity and unlocking billions in bottom line impact",
    "description": "By integrating AI, automation and hybrid cloud tools with tech-agnostic implementation capabilities, IBM is powering productivity gains at global scale. In partnership with BCG, IBM has unlocked over $3B in productivity, and is now bringing those capabilities to joint clients. With watsonx, AI- infused software, and industry expertise, IBM accelerates transformation; optimizing workflows, reducing costs, and driving measurable, sustainable productivity outcomes.",
    "sectorjourneys": "",
    "topicjourneys": "CO",
    "x": 1973,
    "y": 5633,
    "partner": "Y",
    "contacts": "Vikas Taneja, Taneja.Vikas@bcg.com, Matt Leader, Leader.Matthew@bcg.com",
    "highlightUrl": "/highlights/td09.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD10",
    "name": "Red Hat",
    "subtitle": "Open source infrastructure powering innovation in AI and hybrid cloud",
    "description": "Red Hat’s best-of-breed enterprise offerings - including the RHEL platform, Kubernetes-based OpenShift, and automation tools like Ansible - provide cost efficiencies and scalable, secure solutions for modern workloads. Red Hat’s OpenShift AI, OpenShift Virtualization and integration services enable flexible cloud strategies, while its security, support, and consulting capabilities help organizations build, deploy, and manage AI-driven and Hybrid cloud applications efficiently.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1744,
    "y": 5633,
    "partner": "Y",
    "contacts": "Phil Zakahi, Zakahi, Philip <Zakahi.Philip@bcg.com>, Matt Leader, Leader, Matthew <Leader.Matthew@bcg.com>",
    "highlightUrl": "/highlights/td10.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD11",
    "name": "Databricks",
    "subtitle": "Accelerating Data + AI transformation with Databricks",
    "description": "Databricks and BCG are partnering to help clients rapidly scale AI, data transformation and modernization across their enterprise. The booth will showcase solutions that highlight Databricks’ Data Intelligence Platform —spanning GenAI, ML Ops, data foundations, and real-time use case acceleration.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1395,
    "y": 5460,
    "partner": "Y",
    "contacts": "Raul Garcia Mur, GarciaMur.Raul@bcg.com, Megha Ramanuja, Ramanuja.Megha@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/td11.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD12",
    "name": "Data@Scale for Value",
    "subtitle": "Catapult business value with data maturity — accelerate growth and impact",
    "description": "Discover “Data@Scale for Value,” BCG’s strategic initiative to enhance data capabilities and drive business value. Learn how companies can boost data maturity and overcome challenges in tech transformations like (Gen) AI and ERP. Explore BCG’s enterprise-wide approach to leveraging data as a business asset for growth and differentiation—tailored to industries and project archetypes. See how data can become a true competitive advantage.",
    "sectorjourneys": "DS",
    "topicjourneys": "",
    "x": 1395,
    "y": 5285,
    "partner": "",
    "contacts": "Lucas Quarta, quarta.lucas@bcg.com, Helen Han, han.helen@bcg.com, Jacqueline Govers, govers.jacqueline@bcg.com, Benjamin Rehberg, rehberg.benjamin@bcg.com",
    "highlightUrl": "/highlights/td12.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; data; technology transformations; ERP; FI; IG; EN; HC; Financial Institutions; Industrial Goods; Energy; Healthcare"
  },
  {
    "boothId": "TD13",
    "name": "Data and Digital Platforms & Cloud",
    "subtitle": "Build smart. Scale fast. Harness the power of modular tech",
    "description": "Explore cutting-edge Tech, Data, and Digital Platforms (including Cloud) and their role in driving innovation, scalability, and efficiency. Showcased here are fresh insights, real-world impact stories, and an enhanced DDP Immersive game for deeper engagement. Discover how digital platforms and data integration accelerate business growth and transformation through real-world applications and interactive experiences.",
    "sectorjourneys": "AM, BPH, DS, FL, HCS, LCEI, LHI, LPS, ME, PCCI, PPSS, TELE",
    "topicjourneys": "TP",
    "x": 1395,
    "y": 5110,
    "partner": "",
    "contacts": "Marc Schuuring, schuuring.marc@bcg.com, Filippo Scognamiglio, scognamiglio.filippo@bcg.com, Shishir Pathak, pathak.shishir@bcg.com, Nick Smaling, Smaling.Nick@bcg.com",
    "highlightUrl": "/highlights/td13.svg",
    "neighbourhood": "TD",
    "keywords": "GenAI; Google; Microsoft; AWS; Amazon; Anaplan; Workday; ServiceNow; Salesforce; IBM; Redhat; OpenAI; SAP"
  },
  {
    "boothId": "TD14",
    "name": "Google Cloud",
    "subtitle": "The New Way to Cloud",
    "description": "Google Cloud is the new way to the cloud, providing AI, infrastructure, developer, data, security, and collaboration tools built for today and tomorrow. Google Cloud offers a powerful, fully integrated and optimized AI stack with its own planet-scale infrastructure, custom-built chips, generative AI models and development platform, as well as AI-powered applications, to help organizations transform and customers in more than 200 countries turn to Google Cloud as their trusted partner. We will be showcasing Google’s latest technology advancements, including Imagen 3 and Veo 2, our recent wins as a partnership, and how to leverage the partnership for your clients that are using GCP.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1395,
    "y": 4885,
    "partner": "Y",
    "contacts": "Val Elbert, Elbert.Valeriy@bcg.com, Monica Zunick, Zunick.Monica@bcg.com",
    "highlightUrl": "/highlights/td14.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD15",
    "name": "Walt.id",
    "subtitle": "Infrastructure for decentralized ID and ID wallets",
    "description": "Digital wallets are transforming the Internet, managing everything from crypto and Web3 to fiat payments and digital identity. As assets become tokenized and AI-driven fraud rises, wallets are key to ownership, trust, and protection in the digital age. Walt.id offers open-source and enterprise- grade digital identity and wallet infrastructure already enabling thousands of developers, businesses and governments to build ID wallets and digitize or verify any identity data.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 2134,
    "y": 4553,
    "partner": "Y",
    "contacts": "Dominik Beron, dominik@walt.id",
    "highlightUrl": "/highlights/td15.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "TD16",
    "name": "Kore.ai",
    "subtitle": "Conversational AI Meets Agentic Intelligence",
    "description": "For over a decade, Kore.ai has led in enterprise-grade conversational and generative AI. Kore.ai’s flagship Agent Platform enables the creation and orchestration of intelligent, scalable AI agents—transforming how customers and employees interact with systems, services, and data. At this booth, learn how Kore.ai and BCG collaborate to build autonomous AI networks that streamline workflows, enhance CX/EX, and deliver real-world business outcomes through multi-agent orchestration.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1514,
    "y": 5633,
    "partner": "Y",
    "contacts": "Vikash Jain, Jain.Vikash@bcg.com",
    "highlightUrl": "/highlights/td16.svg",
    "neighbourhood": "TD",
    "keywords": ""
  },
  {
    "boothId": "SP01",
    "name": "AI-Enabled Cost Excellence",
    "subtitle": "From rapid wins to sustained value and growth",
    "description": "9 in 10 companies are already using AI technology to optimize costs, but few are seeing tangible bottom-line impact from it.  Through a thought-provoking art installation, visitors will discover what conditions are necessary to unlock lasting value from an AI-enabled cost transformation, and how to thrive in today’s challenging economic landscape.  Explore sector-specific cost journeys, cutting-edge AI solutions and expert insights.",
    "sectorjourneys": "CP, CPBB, EDGFCG, EPIT, GAM, HCS, IET, LCEI, ME, PF, RT, TELE, TTIL",
    "topicjourneys": "CO",
    "x": 1365,
    "y": 2964,
    "partner": "",
    "contacts": "Jacopo Brunelli, brunelli.jacopo@bcg.com, Karin von Funck, vonfunck.karin@bcg.com",
    "highlightUrl": "/highlights/sp01.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; Cost; Consumer Products; CP;  Retail; Integrated Energy Transformation; IET;  Low Carbon Energy & Infrastructure; LCI; Consumer, Private, and Business Banking; CPBB; Global Asset Managers; GAM; Payments & Fintechs; P&F; Engineered Products & Industrial Technology; EPT; Economic Development, Government Finances, Center of Government;  EFC;  Health Care Systems; HCS;  Travel, Transport Infrastructure & Leisure; TTL; Media;  Telecommunications; telcom"
  },
  {
    "boothId": "SP02",
    "name": "Future Fit Organization & AI-First Op Model",
    "subtitle": "BCG’s next-gen operating model offering",
    "description": "Today’s leading organizations face a dual imperative: reshape for the future and unlock exponential value from AI. We have reimagined how organizations tackle these challenges:  •  Future Fit Org Diagnostic - A holistic framework and cost-out  approach to design for resilience & efficiency  •  AI-First Op. Model - A radical shift in how organizations embed AI into  the core ops  •  Org Cost & Functions of future - Key insights into evergreen cost  drivers for organizations including support functions",
    "sectorjourneys": "CIDRET, EDGFCG, EEW, HCS, ME, PPSS, TECH",
    "topicjourneys": "",
    "x": 1680,
    "y": 2964,
    "partner": "",
    "contacts": "Kevin Kelley, kelley.kevin@bcg.com, Nina Kataeva, kataeva.nina@bcg.com, Matt Marchingo, marchingo.matt@bcg.com, Christoph Hilberath, Hilberath.Christoph@bcg.com",
    "highlightUrl": "/highlights/sp02.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; Cost; Support functions; GBS; resilience; operations; operating model; ODOM"
  },
  {
    "boothId": "SP03",
    "name": "Science of Change",
    "subtitle": "From science to change: Unlocking the hidden dividend",
    "description": "Discover the science-backed approach to change and avoid becoming part of the 70% of transformations that fail.  Visit our interactive booth to learn what is new about our offering, where we’ve done it before, and how to do this at scale. Additionally, see how BCG unlocks transformation with tools like our Culture Diagnostic, Leadership Labs, the Momentum Meter, and our newest GPTs.",
    "sectorjourneys": "BPH, LPS",
    "topicjourneys": "",
    "x": 1808,
    "y": 3247,
    "partner": "",
    "contacts": "Gertie Laerkholm, laerkholm.gertie@bcg.com, Kristine Jensson, jensson.kristine@bcg.com, Connor Currier, Currier.connor@bcg.com",
    "highlightUrl": "/highlights/sp03.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; 70%; culture: transform; transformation: TCI: CP: consumer; leadership; behavior; negotiations"
  },
  {
    "boothId": "SP04",
    "name": "Talent & Skills",
    "subtitle": "From potential to performance: Your partner in talent transformation",
    "description": "Talent development and retention is the #1 priority investment area for 75% of C-suite leaders as a cornerstone for growth. BCG’s AI-enhanced Talent & Skills approach helps you transition to a skills-based organization, secure the right talent for future transformations, address critical talent gaps and reduce costs! Discover new features of Talent Builder by BCG X, our E2E talent platform, and explore our latest approaches to tackle your Tech and Digital talent needs.",
    "sectorjourneys": "DS, EEW, LHI, MPI, PCCI",
    "topicjourneys": "",
    "x": 1989,
    "y": 3524,
    "partner": "",
    "contacts": "Suketu Shah, shah.suketu@bcg.com, Nithya Vaduganathan, Vaduganathan.Nithya@bcg.com, Varun Kejriwal, kejriwal.varun@bcg.com",
    "highlightUrl": "/highlights/sp04.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; transformation; digital; technology; consumer; CP; Energy; EN; Industrial Goods; IG; Healthcare; HC; INS; Insurance; TMT; Technology, Media & Telecom; TCI; Public Sector; PS"
  },
  {
    "boothId": "SP05",
    "name": "Microsoft",
    "subtitle": "Transforming business with AI, Agents and Industry Solutions",
    "description": "The Microsoft and BCG partnership combines the transformative power of Microsoft AI technology alongside BCG’s deep industry and functional expertise. Together, we drive innovation across business and technology, unlocking measurable impact. Our work is centered on the priorities of our customers and brought to life through our combined capabilities, allowing us to design, develop, and deploy at scale.  Join us at BCG Edge to discuss how Microsoft and BCG together can reshape functions and reimagine your business, with AI at the core.",
    "sectorjourneys": "",
    "topicjourneys": "TP",
    "x": 1852,
    "y": 4073,
    "partner": "Y",
    "contacts": "Maria Barisano, Barisano.Maria@bcg.com, Michael Sobrepera, Sobrepera.Michael@bcgfed.com",
    "highlightUrl": "/highlights/sp05.svg",
    "neighbourhood": "SP",
    "keywords": ""
  },
  {
    "boothId": "SP06",
    "name": "AI-Powered People Analytics & Insights",
    "subtitle": "Turn complex people data into novel insights at your fingertips",
    "description": "People data is often messy and unstructured, making it difficult to generate insights. Our AI-powered analytics combines BCG’s expertise with advanced AI to deliver fast, robust org diagnostics. An agentic workflow with a GPT- like chat interface and interactive dashboard enables users to run custom segment cuts and quickly uncover novel insights on org design and operating model, talent and skills, and culture and change.",
    "sectorjourneys": "EEW, HCS",
    "topicjourneys": "",
    "x": 1804,
    "y": 3789,
    "partner": "",
    "contacts": "Renee Laverdiere, laverdiere.renee@bcg.com",
    "highlightUrl": "/highlights/sp06.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; Cost; Education, Employment and Welfare; EEW;  Health Care Systems; HCS;"
  },
  {
    "boothId": "SP07",
    "name": "Upskilling with BCG U",
    "subtitle": "Unlock new value, Unleash new capabilities, Upskill your People",
    "description": "BCG U closes the capability gaps that stand between organizations and the realization of their goals by building capabilities that scale their workforce for impact. Our cutting-edge, GenAI-enabled solutions have empowered organizations to excel in delivering ROI for our clients. Attendees will experience an engaging and interactive demonstration of rapid upskilling, featuring a magician who uses captivating tricks and, in the process, teaches guests how to perform them on their own.",
    "sectorjourneys": "EEW, IET",
    "topicjourneys": "",
    "x": 1804,
    "y": 3614,
    "partner": "",
    "contacts": "Elizabeth Lyle, lyle.elizabeth@bcg.com",
    "highlightUrl": "/highlights/sp07.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; Cost; learning; organizations; workforce; consumer; cp; energy; EN; FI; Financial Institutions; HC; Healthcare; Insurance; Public Sector; PS; Climate; Sustainability"
  },
  {
    "boothId": "SP08",
    "name": "Unlocking Financial Insights with AI",
    "subtitle": "Revolutionize finance with real-time AI-powered insights",
    "description": "Experience the future of finance with Analyst.AI. This interactive booth brings the capabilities of our GenAI tool to life through a humanoid Robot Analyst. Attendees can engage in live conversations, view dynamic data visualizations, and explore real-world finance scenarios. Key features include dynamic financial dashboards and scheduled AI demonstrations, providing actionable insights in real time.",
    "sectorjourneys": "EDGFCG",
    "topicjourneys": "CO",
    "x": 1541,
    "y": 3789,
    "partner": "",
    "contacts": "Aaron Arnoldson, arnoldsen.aaron@bcg.com, Mike Demyttenaere, demyttenaere.michael@bcg.com, Raamin Mostaghimi, mostaghimi.raamin@bcg.com, Mike Beyer, beyer.mike@bcg.com",
    "highlightUrl": "/highlights/sp08.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; robot; data; finance; CFO; CFO Excellence; Lighthouse; BCG X; CP; IG; TMT; MSP; Consumer; Industrial Goods; Marketing; Sales; Pricing; Technology, Media & Telecom"
  },
  {
    "boothId": "SP09",
    "name": "Turning Uncertainty into Strategic Advantage",
    "subtitle": "Shaping strategic insight with immersive VR scenarios",
    "description": "Explore the future of decision-making and strategy with immersive VR scenarios designed to stretch our thinking about what different futures may hold. See how a range of uncertainties—from climate to geopolitics, technology to macroeconomics—could intertwine, and critically, what today’s strategists need to do to become better prepared and as resilient as possible. After exploring the scenarios, leaders will dig into how to build competitive advantage in whatever the future may hold.",
    "sectorjourneys": "EEW",
    "topicjourneys": "GP",
    "x": 1541,
    "y": 3613,
    "partner": "",
    "contacts": "Alan Iny, iny.alan@bcg.com, Ketil Gjerstad, gjerstad.ketil@bcg.com, Sam Farley, farley.sam@bcg.com, Sabrina Kristic, kristic.sabrina@bcg.com",
    "highlightUrl": "/highlights/sp09.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; VR; GA; Geopolitics; Global Advantage; Consumer; CP; IG; Industrial Goods; TCI; Market; technology; climate; economics; resilience"
  },
  {
    "boothId": "SP10",
    "name": "Navigating Geopolitical Disruption",
    "subtitle": "Reconfiguring supply chain and procurement in shifting geopolitical landscape",
    "description": "Business leaders are seeking to find their footing in a landscape that has been redefined by tariffs, conflicts, etc. Our booth will highlight the critical need for companies to rapidly and proactively address tariffs, while also contextualizing them within the broader context of geopolitical uncertainties reshaping global supply chains and procurement. Discover our comprehensive solutions that are helping companies navigate these uncertainties effectively.",
    "sectorjourneys": "AM, CBCMIB, EDGFCG, FL, LPS, RT, TTIL",
    "topicjourneys": "CO,GP",
    "x": 1307,
    "y": 3378,
    "partner": "",
    "contacts": "Marc Gilbert, gilbert.marc@bcg.com, Rami Rafih, rafih.rami@bcg.com, Dustin Burke, burke.dustin@bcg.com, Alex Dolya, dolya.alex@bcg.com",
    "highlightUrl": "/highlights/sp10.svg",
    "neighbourhood": "SP",
    "keywords": "Cost; Fashion & Luxury; F&L;  Retail;  Commercial Banking, Capital Markets & Investment Banking; CCIB; Automotive & Mobility;  A&M; Economic Development, Government Finances, Center of Government; EFC; Logistics, Postal & Shipping; Travel, Transport Infrastructure & Leisure; TTL;"
  },
  {
    "boothId": "SP11",
    "name": "Riding the M&A Wave",
    "subtitle": "Avoid a wipeout, and learn how to ride the M&A wave",
    "description": "Deal activity is expected to rise across all industries, with several macro factors driving market recovery after the volatile recent period. But how do these shifts affect each sector? What headwinds and tailwinds matter most—and how can you prepare for the next M&A wave? Learn how evolving dynamics impact deal likelihood and get expert insights to position yourself for success.",
    "sectorjourneys": "GAM, MPI, MT, RT, TECH",
    "topicjourneys": "",
    "x": 1307,
    "y": 3203,
    "partner": "",
    "contacts": "Daniel Friedman, friedman.daniel@bcg.com, Jens Kengelbach, kengelbach.jens@bcg.com, Georg Keienburg, keienburg.georg@bcg.com",
    "highlightUrl": "/highlights/sp11.svg",
    "neighbourhood": "SP",
    "keywords": "GenAI; PMI; Carve-out; market; TMT; HC; healthcare; CP; Consumer Products; EN; Energy; IG; Industrial Goods; FI; Financial Institutions; PIPE; TDA; Tech; Digital; transformation; merger; acquisition"
  },
  {
    "boothId": "SP12",
    "name": "WAIYS",
    "subtitle": "Simplifying AI",
    "description": "This interactive showcase from WAIYS is centered around the humanoid robot Ameca (manufactured by Engineered Arts). WAIYS uses Ameca as an interface for demonstrating the capabilities of digital assistants that run on LLMs and other advanced AI tools; all of which is seamlessly integrated on the WAIYS AI platform. Talk to a robot and experience the future of AI.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1672,
    "y": 3747,
    "partner": "Y",
    "contacts": "Holm Puder, holm.puder@waiys.com",
    "highlightUrl": "/highlights/sp12.svg",
    "neighbourhood": "SP",
    "keywords": ""
  },
  {
    "boothId": "SP13",
    "name": "Workday",
    "subtitle": "AI that illuminates the future of work",
    "description": "In a world that’s moving at the speed of light, you can’t afford to be left in the dark. To keep your business moving forever forward, you need the right technology to manage your most important assets—your people, your money, and your digital workforce. Enter Workday Illuminate™—AI that illuminates the future of work by turning complex data into brilliant insights. Illuminate delivers real value by freeing people to focus on what’s most important and transforming entire business processes. And it’s all available on the Workday platform, when and where you need it—in every language and every region—to elevate humans and supercharge work.  Workday is used by more than 11,000 organizations around the world and across industries – from medium-sized businesses to more than 50% of the Fortune 500.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1990,
    "y": 3091,
    "partner": "Y",
    "contacts": "Suzanne Skipper, Skipper.Suzanne@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/sp13.svg",
    "neighbourhood": "SP",
    "keywords": ""
  },
  {
    "boothId": "OP01",
    "name": "Unlocking Trillions in Capital Projects",
    "subtitle": "De-risk Capital Projects and optimize Net Present Value",
    "description": "The Capital Projects industry faces a super cycle of investment challenged by escalating complexity, cost overruns, and supply chain disruptions.  Join us to explore how AI and digital are transforming Capital Projects and discover our cutting-edge tools:  •  Power-to-X Project Optimizer: Optimization of project scope  value in PtX projects  •  Project Pro: Enhance decision making with Project Pro  integrated controls platform  •  Supply Chain Resilience Co-Pilot: Mitigate supply chain risks  in your Project Portfolio",
    "sectorjourneys": "CIDRET, IET, LCEI",
    "topicjourneys": "",
    "x": 312,
    "y": 3606,
    "partner": "",
    "contacts": "Marco Tonegutti, tonegutti.marco@bcg.com, Dima Pogorelsky, pogorelsky.dima@bcg.com",
    "highlightUrl": "/highlights/op01.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI; Integrated Energy Transformation; IET; Low Carbon Energy & Infrastructure; LCI;  Cities, Infrastructure Development, Real Estate & Tourism; CRT;  de-risk; Net Present Value; NPV; investment cycle;  cost overruns; cost; supply chain; digital; tools; transformation;  Power-to-X Project Optimizer;  Project Pro; Supply Chain Resilience Co-Pilot; scope value; PtX projects; integerated; platform; controls; risks; portfolio; Thales; demos; BCG X; Real Estate"
  },
  {
    "boothId": "OP02",
    "name": "NVIDIA",
    "subtitle": "Empowering the age of AI agents and digital twins with NVIDIA technology",
    "description": "NVIDIA is enabling next-gen enterprise transformation through intelligent agents and industrial digital twins. The booth will spotlight how we jointly deploy NVIDIA’s cutting-edge platforms—including Omniverse and Building Blocks for Agentic AI.",
    "sectorjourneys": "PPSS",
    "topicjourneys": "",
    "x": 312,
    "y": 3433,
    "partner": "Y",
    "contacts": "Tilman Buchner, Buchner.Tilman@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/op02.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI; Cost; Integrated Energy Transformation; IET; Low Carbon Energy & Infrastructure; LCI; Global Asset Managers; GAM; Medical Technologies; MedTech; MT; Payers, Providers, Systems and Services; PPSS; Automotive & Mobility; A&M; Engineered Products & Industrial Technology; EPT; Materials & Process Industries; MPI; Defense & Security; D&S; Health Care Systems; HCS; Cities, Infrastructure Development, Real Estate & Tourism; CRT;  Travel, Transport Infrastructure & Leisure;  TTL; effiecency; cost savings; procurment; procurement journey; revenue; external spend; supplier; AI-powered; spend analytics; contracting; buyer productivity; lost cash; Savings Radar; Tender Assistant; Offer Analyst; ClaimScout; SemiAI; BCG X; Inverto; ACA"
  },
  {
    "boothId": "OP03",
    "name": "Factory of the Future",
    "subtitle": "See Manufacturing AI and advanced robotics with BCG X and partners in action",
    "description": "Our suite powers the Factory of the Future with AI/GenAI and data-driven insights. This year, we focus on:  •  Design – GenAI Factory Advisor  •  Build – SW-defined automation and Embodied AI  •  Run – GenAI-driven Production Systems  Explore demos from Connected Worker and Foxconn work to GenAI applications. See AI-driven robotics in action with Apptronik’s humanoid and our Embodied AI demo, where AI-driven robotics tackle complex tasks with industrial precision, vision systems, and AI Edge Devices.",
    "sectorjourneys": "CP, EPIT, TECH",
    "topicjourneys": "",
    "x": 312,
    "y": 3164,
    "partner": "",
    "contacts": "John Knapp, knapp.john@bcg.com, Alex Yurek, yurek.alex@bcg.com",
    "highlightUrl": "/highlights/op03.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI; Cost; Consumer Products; CP;  Engineered Products & Industrial Technology; EPT;  Technology; Tech; robotics; partners; data-driven; advisor; automation; production systems; Connected Worker; Foxconn; applications; Apptronik; demo; Ai-driven; industrial; vision systems; devices; manufacturing; automoation; optimization; humanoid robot; EmbodiedAI;Microsoft; AWS; Auto; mining; process sectors"
  },
  {
    "boothId": "OP04",
    "name": "Customer Service Excellence",
    "subtitle": "Transform your Customer Service with GenAI",
    "description": "Learn how to leverage GenAI to unlock 60% long-term productivity uplift, see 10+20% short-term P&L impact and increase customer lifetime value by 20-30%.  We offer four types of support: from strategic envisioning and journey kick-start and acceleration, to tech augmentation and development, as well as transformation and change management.",
    "sectorjourneys": "CBCMIB, CPBB, LHI, LPS, ME, PCCI, PF",
    "topicjourneys": "",
    "x": 928,
    "y": 2766,
    "partner": "",
    "contacts": "Marcus Wittig, wittig.marcus@bcg.com, Hrvoje Jenkač, jenkac.hrvoje@bcg.com",
    "highlightUrl": "/highlights/op04.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI; Cost; Commercial Banking, Capital Markets & Investment Banking; CCIB;  Consumer, Private, and Business Banking; CPBB; Payments & Fintechs; P&F; Life and Health Insurance; LHI; P&C and Commercial Insurance; PCI; Insurance; INS; Logistics, Postal & Shipping; LPS;  Media;  productivity; P&L; impact; value; strategy; journey; accelerate; tech augmentation;  tech development; transformation; change management; demos; autonomous selling; autonomous servicing; GenIE; Callsight; analysis tool"
  },
  {
    "boothId": "OP05",
    "name": "E2E Supply Chain Planning Transformation",
    "subtitle": "Elevate your Supply Chain performance with AI and GenAI",
    "description": "Learn how digital and AI can unlock tangible value across supply chain decisions, from demand forecasting to supply optimization. This experience will showcase demos of real-world advance planning solutions and hands-on experience of how GenAI is already reinventing critical supply chain processes, and what the potential is going forward.",
    "sectorjourneys": "AM, BPH, DS, FL, IET, LPS, RT, TECH, TTIL",
    "topicjourneys": "",
    "x": 1019,
    "y": 3661,
    "partner": "",
    "contacts": "Dustin Burke, burke.dustin@bcg.com",
    "highlightUrl": "/highlights/op05.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI; Cost; Fashion & Luxury; F&L; Retail; Integrated Energy Transformation; IET; Biopharma; BP; Automotive & Mobility; A&M; Defense & Security; D&S; Logistics, Postal & Shipping; LPS; Travel, Transport Infrastructure & Leisure; TTL; Technology; Tech; digital; value; demand forecasting; supply optimization; demos; planning solutions; planning; processes; global; vendor partners; client stories; Lyric SC"
  },
  {
    "boothId": "OP06",
    "name": "GenAI-Powered Procurement",
    "subtitle": "Efficiency and cost savings at every step of the procurement journey",
    "description": "Did you know companies use over half of their revenues on external spend and suppliers? Cutting costs without Procurement is impossible. To help with this, our AI-powered approach transforms the entire procurement process, from spend analytics to contracting, helping your clients to reduce external spend, boost buyer productivity and recover lost cash. Visit our booth to learn how we drive real, hands- on savings and efficiency for leading organizations.",
    "sectorjourneys": "AM, CIDRET, DS, EPIT, GAM, HCS, IET, LCEI, MPI, MT, PPSS, TTIL",
    "topicjourneys": "CO,GP",
    "x": 1083,
    "y": 3839,
    "partner": "",
    "contacts": "Tomi Mansio, mansio.tomi@bcg.com, Wolfgang Schnellbächer, schnellbaecher.Wolfgang@bcg.com, Alex Dolya, dolya.alex@bcg.com",
    "highlightUrl": "/highlights/op06.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "OP07",
    "name": "AI in Field Services",
    "subtitle": "Drive commercial growth and elevate field service levels with AI",
    "description": "Field Service functions face global challenges like technician shortages (e.g., costing the trucking industry $2.4B annually) and unplanned downtime (e.g., costing manufacturers up to $50B annually). However, emerging tech - such as connected equipment, GenAI co-pilots, and AR/ VR - offer transformative solutions, creating a step-change in efficiency and effectiveness. Come learn how AI in Field Service can drive 15-20% revenue impact and 5-10pp gross margin impact at scale.",
    "sectorjourneys": "EPIT",
    "topicjourneys": "",
    "x": 1259,
    "y": 4103,
    "partner": "",
    "contacts": "Andy Lin, lin.andy@bcg.com, Hunkar Toyoglu, toyoglu.hunkar@bcg.com",
    "highlightUrl": "/highlights/op07.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI; Engineered Products & Industrial Technology; EPT;  commercial growth; technicians; downtime; manufacturing; cost; connected equipment; emerging tech; co-pilots; AR/VR; solutions; transformation; efficiencies; revenue impact; scale; operations; work order management; sales performance; dashboard; predictive maintenance; technician co-pilot; Building Services; Aerospace; Offroad Heavy Equipment; Oil & Gas; Tech; telcomm; Healthcare equipment; Production Line Equipment"
  },
  {
    "boothId": "OP08",
    "name": "Anaplan",
    "subtitle": "The only AI-infused scenario planning and analysis platform designed to optimize decision-making",
    "description": "Anaplan is the only scenario planning and analysis platform designed to optimize decision-making in today’s complex business environment so that enterprises can outpace their competition and the market. By building connections and collaboration across organizational silos, our platform intelligently surfaces key insights — so businesses can make the right decisions, right now. More than 2,400 of the world’s best brands continually optimize their decision-making by planning with Anaplan.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1084,
    "y": 4103,
    "partner": "Y",
    "contacts": "Nick Tanaka, Tanaka.Nicolas@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/op08.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "OP09",
    "name": "AI-Powered R&D",
    "subtitle": "Explore AI-driven R&D to unlock efficiency and acceleration",
    "description": "Embark on an AI-powered R&D journey—boosting efficiency, exploration, and innovation. Experience AI’s impact at every stage: accelerating time- to-market, unlocking creativity, and driving market alignment. Discover interactive demos, real-world case studies, and practical insights to lead the future of innovation. Let’s redefine R&D together!",
    "sectorjourneys": "BPH, EPIT, MT",
    "topicjourneys": "AI",
    "x": 679,
    "y": 3850,
    "partner": "",
    "contacts": "Mikaël Le Mouëllic, lemouellic.mikael@bcg.com",
    "highlightUrl": "/highlights/op09.svg",
    "neighbourhood": "OP",
    "keywords": "GenAI;  Biopharma; BP;  Medical Technologies; MedTech; MT; Engineered Products & Industrial Technology; EPT;  efficiency; acceleration; innovation; time-to-market; creativity; market alignment; demos; case studies; research; development; research & development"
  },
  {
    "boothId": "OP10",
    "name": "ServiceNow",
    "subtitle": "Bring AI + Data + Workflows to every corner of your business with ServiceNow, the AI platform",
    "description": "for business transformation  ServiceNow is putting AI to work for people. We move with the pace of innovation to help clients transform organizations across every industry while upholding a trustworthy, human-centered approach to deploying our products and services at scale. Our AI platform for business transformation connects people, processes, data, and devices to increase productivity and maximize business outcomes. Bring AI + Data + Workflows to every corner of your business with ServiceNow.",
    "sectorjourneys": "TELE",
    "topicjourneys": "TP",
    "x": 732,
    "y": 4108,
    "partner": "Y",
    "contacts": "Leo Tomlin, Tomlin.Leo@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/op10.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "OP11",
    "name": "Amazon Web Services",
    "subtitle": "Accelerated automotive development with GenAI solutions on AWS",
    "description": "AWS Embedded Software Demo for the Auto Industry: End-to-end example of implementing a code change in the infotainment system and instrument cluster of the vehicle.  Using Q Developer Agent, this demo modifies the instrument cluster written with Cluster Instrument Studio Software, then via a CICD pipeline creates a virtualized infotainment and instrument cluster on a Panasonic vSkipGen. The code change will modify how the driver is informed of active safety notifications from another virtual ECU going through a virtual zonal gateway, highlighting how an integrated virtual test bench.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 643,
    "y": 3661,
    "partner": "Y",
    "contacts": "Stephen Robnett, Robnett.Stephen@bcg.com, Hillary Fernandez, Fernandez.Hillary@bcg.com",
    "highlightUrl": "/highlights/op11.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "OP12",
    "name": "Lyric",
    "subtitle": "Empowering teams to build & scale AI-powered supply chain intelligence",
    "description": "Lyric has developed an innovative platform that transforms supply chain problem-solving with composable decision intelligence. As modelers and planners face increasing demands, outdated technology falls short. Lyric empowers them to move beyond rigid, off-the-shelf solutions, enabling the creation of tailored, always-on models that evolve with their business. Lyric supports rapid, iterative development of modeling, planning, and frontier solutions that supply chain organizations can rely on.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 965,
    "y": 3484,
    "partner": "Y",
    "contacts": "Dinesh Natarajan, dinesh@lyric.tech",
    "highlightUrl": "/highlights/op12.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "OP13",
    "name": "Apptronik",
    "subtitle": "We make robots for humans",
    "description": "Apptronik is a human-centered robotics company developing AI-powered humanoid robots. Our goal is to create human helpers to support humanity in every facet of life. Our robot, Apollo, is designed to collaborate thoughtfully with humans—initially in critical industries such as manufacturing and logistics, with future applications in healthcare, the home, and beyond.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 511,
    "y": 3094,
    "partner": "Y",
    "contacts": "Barry Phillips, barryphillips@apptronik.com",
    "highlightUrl": "/highlights/op13.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "OP14",
    "name": "Sievo",
    "subtitle": "Cleanse & enrich procurement data to deliver actionable insights using AI",
    "description": "Sievo automates procurement data cleansing, enrichment, and analytics, solving data chaos and delivering actionable insights, forecasting, and ESG analytics. Trusted by industry leaders like BCG, TotalEnergies, and Apax Partners. We provide insights and benchmarks from internal, external, and cross-customer data, processing 2% of global GDP. As BCG’s premier partner for Spend, CO2, and ESG cubes, Sievo delivers quick cubes in ~4 days and expert cubes in 2-6 weeks. Recognized as best-in-class in data management, automation, AI/ML, and advanced analytics by SpendMatters.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 862,
    "y": 3451,
    "partner": "Y",
    "contacts": "Sammeli Sammalkorpi, sammeli.sammalkorpi@sievo.com",
    "highlightUrl": "/highlights/op14.svg",
    "neighbourhood": "OP",
    "keywords": ""
  },
  {
    "boothId": "CE01",
    "name": "Customer Experience & Immersive Commerce",
    "subtitle": "Elevating customer journeys and driving deeper engagement across channels",
    "description": "Adopting next-gen strategies like conversational commerce, marketplaces, and reimagined customer journey frameworks are key ways to elevate CX, boost engagement, and build loyalty. These approaches empower customers to make informed purchasing decisions, drive demand, and streamline sales by bridging owned channels with the platforms customers already engage on. They also help brands optimize resources and reduce overhead.  Explore how these tactics can transform your CX for the future!",
    "sectorjourneys": "CPBB, FL, TTIL",
    "topicjourneys": "",
    "x": 711,
    "y": 2404,
    "partner": "",
    "contacts": "Karen Lellouche, lellouche.karen@bcg.com",
    "highlightUrl": "/highlights/ce01.svg",
    "neighbourhood": "CE",
    "keywords": "GenAI; Cost; Fashion & Luxury; F&L; Consumer, Private, and Business Banking; CPBB; Travel, Transport Infrastructure & Leisure; TTL;  customer journey; CX, next-gen strategies; commerce, marketplace;  channels; sales; customer platform; platform; overhead; purchasing; engagement; streamline"
  },
  {
    "boothId": "CE02",
    "name": "Salesforce",
    "subtitle": "Where humans with Agents drive customer success together",
    "description": "Salesforce and BCG deliver AI-powered business advantage. By combining BCG’s industry-leading functional expertise with Salesforce’s agentic AI capabilities through Agentforce, we drive faster time to value and adoption — ensuring measurable business impact from day one.  New research reveals how businesses scale AI agents 16x faster and 75% more accurately with Agentforce. Stop by our booth to see Agentforce in action and drop in to build your own AI agent.",
    "sectorjourneys": "TELE",
    "topicjourneys": "TP",
    "x": 711,
    "y": 2228,
    "partner": "Y",
    "contacts": "Bryan Gauch, Gauch.Bryan@bcg.com, Deborah Riger, Riger.Deborah@bcg.com",
    "highlightUrl": "/highlights/ce02.svg",
    "neighbourhood": "CE",
    "keywords": ""
  },
  {
    "boothId": "CE03",
    "name": "NextGen Sales",
    "subtitle": "Advance the art and science of Sales by leveraging GenAI, data and tech",
    "description": "Step into the future of sales with NextGenSales! Discover how GenAI transforms sales organizations with intelligent agents, cutting-edge automation, and seamless integration across your CRM and tech stack. Unlock smarter workflows, harness data for sharper insights, and boost productivity to crush your sales goals. Whether you’re looking to streamline processes or stay ahead of the competition, this is where innovation meets sales success. Stop by and see what’s next!",
    "sectorjourneys": "BPH, CBCMIB, EPIT, LHI, ME, MPI, MT, PCCI, TECH, TELE",
    "topicjourneys": "AI",
    "x": 767,
    "y": 1931,
    "partner": "",
    "contacts": "Phillip Andersen, andersen.phillip@bcg.com, Basir Mustaghni, Mustaghni, Basir Mustaghni.Basir@bcg.com",
    "highlightUrl": "/highlights/ce03.svg",
    "neighbourhood": "CE",
    "keywords": "GenAI; Cost; Commercial Banking, Capital Markets & Investment Banking; CCIB; Biopharma; BP; Medical Technologies; Medtech; MT; Engineered Products & Industrial Technology; EPT; Materials & Process Industries; MPI; Life and Health Insurance; LHI;  P&C and Commercial Insurance; PCI; Insurance; INS;  Media;  Technology; Tech; Telecommunications; telcom;  sales; data; tech;  intelliigent agents; automation; integration; CRM; workflows; sales goals; streamline;  avatar; GENie; Buddy, Sales Sherpa"
  },
  {
    "boothId": "CE04",
    "name": "Pencil",
    "subtitle": "Generate marketing 55% faster, 62% cheaper and 40% better performing",
    "description": "Pencil, a Brandtech company, is helping brands unlock creative agility at scale through AI-generated advertising that learns and predicts what works. Pencil enables marketing organizations to transform their functions while generating, testing, and optimizing ad creatives in minutes—not weeks—to drive performance and efficiency through closed-loop learning.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 892,
    "y": 2115,
    "partner": "Y",
    "contacts": "Alex Baxter, Baxter.Alex@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/ce04.svg",
    "neighbourhood": "CE",
    "keywords": ""
  },
  {
    "boothId": "CE05",
    "name": "Writer",
    "subtitle": "The end-to-end platform for scaling agentic AI in the enterprise",
    "description": "Writer empowers enterprises to create their AI HQ—where IT and business collaborate to build, activate, and supervise AI agents together without compromise, all in one place. Powered by our Palmyra LLMs purpose-built for enterprises and Knowledge Graph, our graph-based RAG solution, Writer agents deliver unmatched accuracy, reliability, and control—all within a consumer-grade experience that accelerates adoption. From pre-built solutions to no-code and low-code builder tools, every business function is empowered to rebuild processes from the ground up—all under IT governance that ensures secure deployment at scale.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 999,
    "y": 2115,
    "partner": "Y",
    "contacts": "Alex Baxter, Baxter.Alex@bcg.com, Joe Vasquez, Vasquez.Joe@bcg.com",
    "highlightUrl": "/highlights/ce05.svg",
    "neighbourhood": "CE",
    "keywords": ""
  },
  {
    "boothId": "CE06",
    "name": "Personalization & Marketing",
    "subtitle": "Unlock the future of marketing with AI & data-driven personalization",
    "description": "AI is revolutionizing marketing and personalization, enabling brands to create tailored experiences at scale. Explore how AI-generated content, intelligent automation, and predictive insights optimize customer engagement and drive deeper connections. Unlock new levels of efficiency, automate decision-making, and create dynamic, personalized journeys that maximize marketing impact. Discover the AI-powered future of marketing – live at our booth!",
    "sectorjourneys": "CPBB, FL, GAM, PF, TTIL",
    "topicjourneys": "",
    "x": 1138,
    "y": 1931,
    "partner": "",
    "contacts": "Lauren Wiener, wiener.lauren@bcg.com, Mark Abraham, abraham.mark@bcg.com, Silvio Palumbo, palumbo.silvio@bcg.com",
    "highlightUrl": "/highlights/ce06.svg",
    "neighbourhood": "CE",
    "keywords": "GenAI; Cost;  Fashion & Luxury; F&L;  Consumer, Private, and Business Banking; CPBB;  Global Asset Managers; GAM; Payments & Fintechs; P&F; Travel, Transport Infrastructure & Leisure; TTL; data-driven; brand; scale; intelligent automation; predictive insight; customer engagement; automate; journey; Fabriq; assessments"
  },
  {
    "boothId": "CE07",
    "name": "Customer Insight & Innovation",
    "subtitle": "GenAI-powered customer intelligence redefines strategy and innovation",
    "description": "Discover Market Mirror, our cutting-edge GenAI offer that turns insights into growth strategies and marketing impact. Gain a 360° view of customer demand spaces for faster, smarter decisions. Use dynamic wargaming, scenario planning, and targeting strategies to refine business moves with precision. See how integrated intelligence sharpens competitive advantage, accelerates innovation, and drives impactful strategies.",
    "sectorjourneys": "AM, CBCMIB, CP, FL",
    "topicjourneys": "",
    "x": 1182,
    "y": 2228,
    "partner": "",
    "contacts": "Ben Eppler,  eppler.ben@bcg.com, Lara Koslow, koslow.lara@bcg.com, Lauren Taylor, taylor.lauren@bcg.com",
    "highlightUrl": "/highlights/ce07.svg",
    "neighbourhood": "CE",
    "keywords": "GenAI; Cost;  Consumer Products; CP; Fashion & Luxury; F&L;  Commercial Banking, Capital Markets & Investment Banking; CCIB;  Automotive & Mobility; A&M;  customer intelligence; innovation; strategy;  Market Mirror; growth strategies; marketing; demand; scenario planning; business strategy; competitive advantage; platform; avatar"
  },
  {
    "boothId": "CE08",
    "name": "Strategic Pricing",
    "subtitle": "Understand the 7 pricing games with AI tools to deliver 3-5% impact",
    "description": "As pricing power has become more challenging and the days ahead are uncertain, pricing is top of mind for CEOs. BCG’s strategic pricing framework – the 7 games and our insights in how to win them – helps companies succeed in these times. Discover the pricing game you are playing in, and deep dive into the AI Pricing solution that will enable you to win this game. The content will be supported by BCG’s recently launched “Game Changer” book.",
    "sectorjourneys": "CP, GAM, LPS, ME, MT, PF, RT",
    "topicjourneys": "",
    "x": 1182,
    "y": 2405,
    "partner": "",
    "contacts": "Arnab Sinha, sinha.arnab@bcg.com",
    "highlightUrl": "/highlights/ce08.svg",
    "neighbourhood": "CE",
    "keywords": "GenAI; Cost; Consumer Products; CP;  Retail; Global Asset Managers; GAM: Payments & Fintechs; P&F; Medical Technologies; MedTech; MT;  Logistics, Postal & Shipping; LPS;  impact; pricing power; pricing game;  pricing solution; Game Changer"
  },
  {
    "boothId": "CE09",
    "name": "Think Bigger. Think Bolder. Think BrightHouse",
    "subtitle": "Differentiate your work with offerings that drive value, impact, and revenue",
    "description": "For 10 years, BrightHouse has helped BCG drive leadership ambitions, consumer and employee loyalty, and impact across organizations. BrightHouse gives BCG a competitive advantage by expanding topics for clients and enhancing BCG’s overall brand. We help solve complex challenges and uncover timeless truths that enable organizations to thrive in an ever-changing business landscape.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1398,
    "y": 2407,
    "partner": "",
    "contacts": "Tim Kuhrcke, kuhrcke.tim@bcgbrighthouse.com",
    "highlightUrl": "/highlights/ce09.svg",
    "neighbourhood": "CE",
    "keywords": "Tech; Media; telcom; TMT; Health Care; HC; Public Sector;PS;  Consumer; Energy; EN;  Financial Institutions; FI; Insurance; INS;  Industrial Goods;IG;  Travel, Cities, & Infrastructure; CRT;  value; impact; revenue; consumer; employee loyalty;  competitive advantage; topics; brand; solutions; business landscape; ChatGPT; offerings; digitial"
  },
  {
    "boothId": "AI01",
    "name": "Amplify Impact",
    "subtitle": "Experience GenAI innovations firsthand: Engage, learn and transform",
    "description": "Visit our booth for expert insights on GenAI transformation and live demos! Explore hands-on change management initiatives, practical playbooks for scaling GenAI product development and adoption, and expert-led sessions on real-world GenAI use cases. Learn how BCG has harnessed GenAI to streamline operations, drive innovation, and enhance enjoyment at work. Engage with our MDPs, interactive demos and discover strategies for enterprise-wide AI success creating measurable impact.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 1953,
    "y": 2378,
    "partner": "",
    "contacts": "Scott Wilder, Wilder.Scott@bcg.com",
    "highlightUrl": "/highlights/ai01.svg",
    "neighbourhood": "AI",
    "keywords": ""
  },
  {
    "boothId": "FS01",
    "name": "Decarbonization: Cut Costs, Add Value",
    "subtitle": "Viable solutions for a world in transition",
    "description": "Cash and carbon–these themes go together. Decarbonization is not just about reducing emissions—it’s about unlocking value and cutting costs. Step up to our Value vs. Carbon challenge, a high-stakes betting experience where you’ll see how sustainability decisions impact value, cost, and carbon emissions. Learn about BCG tools that enable clients to save big. Explore BCG’s cutting-edge solutions in areas such as hydrogen and renewables. Are you ready to bet on the future? Visit us to find out!",
    "sectorjourneys": "IET, LCEI",
    "topicjourneys": "",
    "x": 292,
    "y": 1327,
    "partner": "",
    "contacts": "Patrick Herhold, herhold.patrick@bcg.com",
    "highlightUrl": "/highlights/fs01.svg",
    "neighbourhood": "FS",
    "keywords": "Cost; Decarbonization; Carbon footprint; emissions; sustainability; climate; EN; IG; TCI; CP; hydrogen; renewables; low carbon energy & infrastructure; integrated energy transformation; materials & process industries; OEM; Infrastructure, Development, Engineering & Construction; HC; Healthcare; Consumer Products; Operations; Principal Investors & Private Equity; PIPE"
  },
  {
    "boothId": "FS02",
    "name": "Net Positive Food Systems",
    "subtitle": "Scaling regeneration, unlocking finance and empowering farmers",
    "description": "As the frequency of extreme weather events continues to intensify, the question of how we feed a growing population remains central.  BCG and the World Business Council for Sustainable Development (WBCSD) have launched global initiatives to drive large-scale transformation of the agricultural system. At its heart are our digital capabilities that are unlocking partnership opportunities, financial incentives and empowering farmers – come demo RegenAtlas a tool prioritizing high-impact investments.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 292,
    "y": 1001,
    "partner": "",
    "contacts": "Shalini Unnikrishnan, unnikrishnan.shalini@bcg.com",
    "highlightUrl": "/highlights/fs02.svg",
    "neighbourhood": "FS",
    "keywords": "Agriculture; RegenAtlas; Sustainability; Climate; IG; Industrial Goods; Materials & Process Industries; PIPE; Social Impact; SI; PS; Public Sector; FI; Financial Institutions; CON; Consumer Products; Retail; Fashion & Luxury; MPI; Materials & Process Industries"
  },
  {
    "boothId": "FS03",
    "name": "Center for Sustainability Policy & Regulation",
    "subtitle": "Navigate sustainability policy and regulation in uncertain times",
    "description": "In a world where shifting leadership reshapes climate commitments, BCG helps clients navigate complexity and seize opportunities. We integrate policy & regulatory expertise, and digital capabilities—delivering differentiated insights to assess risks and opportunities in an evolving landscape. High-emission industries like aluminium ($250B) & cement ($500B) face billion-dollar investment risks over the next 20 years. See how we cut through regulatory volatility to drive informed decision-making.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 299,
    "y": 560,
    "partner": "",
    "contacts": "Edmond Rhys Jones, rhysjones.edmond@bcg.com, Jannik Leiendecker, leiendecker.jannik@bcg.com",
    "highlightUrl": "/highlights/fs03.svg",
    "neighbourhood": "FS",
    "keywords": "GenAI; emissions; carbon markets; climate; policy pulse; FI; EN; IG; CP; PS; TCI; HC; TMT; Financial Institutions; Healthcare; Energy; Industrial Goods; Consumer Products; Travel, Cities and Infrastructure;  Technology, Media & Telecom"
  },
  {
    "boothId": "FS04",
    "name": "CO2 AI",
    "subtitle": "The net zero partner for ambitious corporates",
    "description": "Trusted by 400+ enterprises like Sysco and General Mills, CO2 AI's platform drives sustainability across organizations and supply chains. Our AI delivers actionable carbon footprints in minutes at corporate and product-level, enabling operational teams such as Procurement and R&D to identify additional reduction initiatives and keep track of progress in one platform. Visit us to accelerate your decarbonization journey.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 234,
    "y": 186,
    "partner": "Y",
    "contacts": "Diana Dimitrova, Dimitrova.Diana@bcg.com, Sophia Davies, Davies.Sophia@bcg.com",
    "highlightUrl": "/highlights/fs04.svg",
    "neighbourhood": "FS",
    "keywords": ""
  },
  {
    "boothId": "FS05",
    "name": "Climate Risk, Adaptation, and Resilience",
    "subtitle": "Adapt to thrive in the face of extreme climate risks",
    "description": "As 1.5°C slips further out of reach, public and private sectors must prepare for severe climate impacts. Businesses face a dual challenge: physical risks stemming from extreme weather and transition risks driven by global shift toward a low-carbon economy. To mitigate, it is imperative to develop adaptation and resilience strategies today—not years from now. Learn how BCG is advancing the adaptation and resilience agenda and leveraging analytics-driven solutions to support organizations globally.",
    "sectorjourneys": "CBCMIB, CIDRET, LHI, PCCI, TELE",
    "topicjourneys": "GP",
    "x": 518,
    "y": 178,
    "partner": "",
    "contacts": "Lorenzo Fantini, fantini.lorenzo@bcg.com, Annika Zawadzki, zawadzki.annika@bcg.com",
    "highlightUrl": "/highlights/fs05.svg",
    "neighbourhood": "FS",
    "keywords": "Cost;"
  },
  {
    "boothId": "FS06",
    "name": "Carbon Intelligence at Scale",
    "subtitle": "Create a competitive edge through Quantis’ environmental data and tools",
    "description": "Companies are being asked by clients and regulators to provide product carbon footprints that reflect reality for tracking progress and informing decisions. Meanwhile, they struggle to meet their voluntary commitments to reduce environmental impacts in Scope 3.  Discover how Quantis leverages its data and AI capabilities to help companies simulate a product’s environmental impact quickly and cost-effectively, while accurately representing the supply chain to reduce business risk.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 854,
    "y": 445,
    "partner": "",
    "contacts": "Allon Zeitoun, zeitoun.allon@quantis.com, Marcial Vargas, vargasgonzalez.marcial@quantis.com",
    "highlightUrl": "/highlights/fs06.svg",
    "neighbourhood": "FS",
    "keywords": "Quantis; sustainability; carbon footprint; scope 3; AI; risk; cost; CP; Consumer Products; IG; Industrial Goods; Packaging; Chemicals; Agriculture; Fashion & Luxury; Retail"
  },
  {
    "boothId": "FS07",
    "name": "Design to Sustainable Value",
    "subtitle": "Reimagine products to balance cost, value, health, and sustainability",
    "description": "When companies (re)design their products, they often optimize for some combination of cost, customer value, or health/sustainability – but rarely for all three. Our experience shows us that companies that look at product design with these three lenses in mind can capture superior value and future-proof their portfolio. Learn how BCG is enabling companies to understand the impact of design choices across these metrics – and take a deep dive into the power of using circularity as a design lever.",
    "sectorjourneys": "CP",
    "topicjourneys": "",
    "x": 912,
    "y": 712,
    "partner": "",
    "contacts": "Alejandro Navarro, navarro.alejandro@bcg.com, Mikael le Mouellic, lemouellic.mikael@bcg.com, Sophie Gebel, gebel.sophie@bcg.com, Alex Meyer zum Felde, meyer.zum.felde.alexander@bcg.com",
    "highlightUrl": "/highlights/fs07.svg",
    "neighbourhood": "FS",
    "keywords": "Cost; Ops; Operations; Healthcare; HC; IG; Industrial Goods; MSP; Marketing, Sales and Pricing; Climate; Sustainability; Consumer; CP; Retail; design; product design"
  },
  {
    "boothId": "FS08",
    "name": "Monetizing Green",
    "subtitle": "Create real value from low carbon products — match, monetize, decarbonize",
    "description": "Are you a supplier looking to unlock the full value of low-carbon inputs or a brand/OEM aiming to scale Scope 3 decarbonization?  The Carbon Footprint Ledger (CFL) is a first-of-a-kind tech solution that connects demand for low carbon products with available supply—creating a win-win across entire value chain:  •  Suppliers – Monetize green attributes and sell premium products  •  Brands/OEMs – Decarbonize supply chains and unlock  green opportunities  Turn sustainability into your competitive advantage!",
    "sectorjourneys": "AM, MPI",
    "topicjourneys": "",
    "x": 912,
    "y": 940,
    "partner": "",
    "contacts": "Cornelius Pieper, pieper.cornelius@bcg.com",
    "highlightUrl": "/highlights/fs08.svg",
    "neighbourhood": "FS",
    "keywords": "Decarbonization; low-carbon; scope 3; carbon footprint; OEMs; supply chain; green; IG; Industrial Goods; EN; Energy; CP; Consumer Products; Climate; Sustainability; TDA; BCG X; MSP"
  },
  {
    "boothId": "FS09",
    "name": "Breakthrough Energy",
    "subtitle": "Pioneering the future of clean technology",
    "description": "Breakthrough Energy is driving the transition to a sustainable future by supporting groundbreaking innovations in clean technology. At this expo, we showcase pioneering ventures from our BE Ventures portfolio across: Ecocem, revolutionizing low-carbon cement; and Rondo, transforming industrial heat with electro-thermal energy storage. Together, these companies are accelerating the path to net zero by redefining how we build, power, and sustain our world.",
    "sectorjourneys": "",
    "topicjourneys": "",
    "x": 842,
    "y": 1202,
    "partner": "Y",
    "contacts": "Behar Carroll, carroll.bahar@bcgfed.com",
    "highlightUrl": "/highlights/fs09.svg",
    "neighbourhood": "FS",
    "keywords": ""
  },
  {
    "boothId": "FS10",
    "name": "Green Growth Accelerator",
    "subtitle": "Build and scale new green businesses and revenue streams",
    "description": "The green growth opportunity is accelerating, driven by value pools, tech breakthroughs, and investor momentum. Green Growth Accelerator (GGA) partners with corporates, investors, and scale-ups to build and scale green businesses. Our approach blends execution focus, cutting-edge tools, and collaboration to embed sustainability as a competitive edge. By leveraging digital, capital, and partnerships, we turn sustainability challenges into profitable, scalable solutions.",
    "sectorjourneys": "CBCMIB, CIDRET, EDGFCG, LCEI",
    "topicjourneys": "",
    "x": 819,
    "y": 1467,
    "partner": "",
    "contacts": "Mads Peter Langhorn, langhorn.madspeter@bcg.com",
    "highlightUrl": "/highlights/fs10.svg",
    "neighbourhood": "FS",
    "keywords": "Sustainability; investors; green; EN; IG; TCI; PIPE; Energy; Industrial Goods; Principal Investors & Private Equity; Travel, Cities & Infrastructure"
  }
]